using System.Collections.Generic;

namespace BlindBoxPlugin
{
    internal class BlindBoxData
    {
        /// <summary>
        /// 特殊配给货箱（红莲）
        /// </summary>
        public static List<string> MaterielContainer40 = new()
        {
            "飞行座椅",
            "渡渡鸟角笛",
            "火巨人角笛",
            "优雷卡盐蓝燕角笛",
            "巧儿海陆行鸟",
            "獭獭",
            "龙之孙",
            "刺球球",
            "分福",
            "旅雀儿",
            "新型迷你夕雾",
            "迷你格林瓦特",
            "迷你鲶鱼精",
            "伊沃恩玩偶",
            "迷你奇美拉",
            "魔导复仇者追踪型",
            "吉多",
            "迷你库洛",
            "须佐之男之形",
            "吉祥天女之形",
            "俾斯麦之形",
            "迷你飞燕",
            "罗波那之形",
            "豆豆柴",
            "天狗玩偶",
            "象魔人偶",
            "六角小螈螈",
            "小树袋熊",
            "神龙玩偶",
            "椒盐海豹",
            "暴龙角笛",
            "白鼬",
            "迷你玛格奈",
            "迷你莫艾石像",
            "米斯拉人偶",
            "迷你法夫纳",
            "常风王子",
            "白小虎",
            "舞海月",
            "金鲶",
            "凯西幼苗",
            "塔鲁塔鲁人偶",
            "迷你纱都",
            "齐天小圣",
            "迷你熙洛",
            "朱孔雀",
            "泥小点",
            "艾尔凡人偶",
            "小长颈驼",
            "水豚幼崽",
            "青帝",
            "有限的美德",
            "迷你武装重甲",
            "小雪童子",
            "南方度假獭獭",
            "小刺猬"
        };
        /// <summary>
        /// 特殊配给货箱（重生/苍穹）
        /// </summary>
        public static List<string> MaterielContainer30 = new()
        {
            "祖角笛",
            "黑天马笛",
            "爆弹仔",
            "自走人偶001号",
            "巧儿陆行鸟",
            "密林人偶003号",
            "魔界花骨朵",
            "小松鼠",
            "魔菇宝",
            "青鸟",
            "小小魔精",
            "冬贝利玩偶",
            "精金幼龟",
            "小蝙蝠",
            "树苗精",
            "灰尘兔",
            "无头骑士模型",
            "巨蝌蚪",
            "胖墩跳蜥",
            "小壳蟹",
            "矿爬虫虫",
            "小山羊玩偶",
            "一口小果冻",
            "魔导先锋追踪型",
            "恶魔砖块",
            "粘液胶",
            "无敌号模型",
            "卢恩人玩偶",
            "软软垫子",
            "奥猴宝宝",
            "夺心小魔",
            "不说话的蜂鸟",
            "魔法扫帚",
            "茄子骑士",
            "蒜头明星",
            "番茄国王",
            "蔓德拉王后",
            "小梦貘",
            "娜娜珂小熊",
            "发条矿车",
            "食果花鼠",
            "淘气南加",
            "猫小胖",
            "小脚雪人",
            "小木乃伊",
            "暗斗鱼苗",
            "自律型魔导浮游炮",
            "独角幼兽",
            "小小阿托莫斯",
            "猫头小鹰",
            "风筝小猫",
            "发条推车",
            "小熊猫",
            "63页",
            "铁小人",
            "格斯塔拉",
            "7号蒸汽小战车",
            "淘金热",
            "猴面雀儿",
            "青蓝小手",
            "猎鹰",
            "叶小妖妖",
            "伊弗利特之形",
            "迦楼罗之形",
            "泰坦之形",
            "利维亚桑之形",
            "卡尔克",
            "蓝闪蝶",
            "芬里尔幼崽",
            "拉姆之形",
            "希瓦之形",
            "触手",
            "腕龙玩偶",
            "小矮兔",
            "新型迷你桑克瑞德",
            "新型迷你阿莉塞",
            "疣猪小子",
            "疣猪小子",
            "迷你艾达",
            "斗牛小犬",
            "迷你埃斯蒂尼安"
        };
        /// <summary>
        /// 九宫幻卡铜包
        /// </summary>
        public static List<string> BronzeTriadCard = new()
        {
            "九宫幻卡：魔石精",
            "九宫幻卡：软糊怪",
            "九宫幻卡：矿爬虫",
            "九宫幻卡：冥鬼之眼",
            "九宫幻卡：古菩猩猩",
            "九宫幻卡：魔导死亡爪",
            "九宫幻卡：梦魔",
            "九宫幻卡：奇美拉",
            "九宫幻卡：蓝龙",
            "九宫幻卡：美男子布迦加",
            "九宫幻卡：液态火焰",
            "九宫幻卡：邮差莫古力",
            "九宫幻卡：贝希摩斯",
            "九宫幻卡：招雷巨蛇",
            "九宫幻卡：晴天霹雳托佐尔·法托特尔",
        };
        /// <summary>
        /// 九宫幻卡银包
        /// </summary>
        public static List<string> SilverTriadCard = new()
        {
            "九宫幻卡：蜥蜴人",
            "九宫幻卡：鸟人",
            "九宫幻卡：坏妖精",
            "九宫幻卡：地灵",
            "九宫幻卡：塔塔露·塔露",
            "九宫幻卡：塞壬",
            "九宫幻卡：泰坦",
            "九宫幻卡：贤王莫古尔·莫古十二世",
            "九宫幻卡：于里昂热·奥居雷",
            "九宫幻卡：弗迪亚",
            "九宫幻卡：敏菲利亚",
            "九宫幻卡：无影拉哈布雷亚",
            "九宫幻卡：伊弗利特",
            "九宫幻卡：迦楼罗",
        };
        /// <summary>
        /// 九宫幻卡金包
        /// </summary>
        public static List<string> GoldTriadCard = new()
        {
            "九宫幻卡：莫莫蒂·莫蒂",
            "九宫幻卡：十指巴德龙",
            "九宫幻卡：缪恩",
            "九宫幻卡：盖罗尔特·布拉克索恩",
            "九宫幻卡：究极神兵",
            "九宫幻卡：西德·加隆德",
            "九宫幻卡：光之战士",
            "九宫幻卡：吉坦·特莱巴尔",
            "九宫幻卡：赫利·博尔达&库尔特内",
            "九宫幻卡：利维亚桑",
            "九宫幻卡：拉姆",
            "九宫幻卡：希瓦",
            "九宫幻卡：嘉恩·艾·神纳",
            "九宫幻卡：梅尔维布·布鲁菲斯维因",
            "九宫幻卡：劳班·阿尔丁",
        };
        /// <summary>
        /// 九宫幻卡灵银包
        /// </summary>
        public static List<string> MythrilTriadCard = new()
        {
            "九宫幻卡：吉尔伽美什&恩奇都",
            "九宫幻卡：奥丁",
            "九宫幻卡：洋葱剑士",
            "九宫幻卡：巴兹·克劳泽",
            "九宫幻卡：蒂娜·布兰福德",
            "九宫幻卡：维德佛尔尼尔",
            "九宫幻卡：长须豹女王",
            "九宫幻卡：皮平·塔鲁平",
            "九宫幻卡：腕龙",
        };
        /// <summary>
        /// 帝国九宫幻卡包
        /// </summary>
        public static List<string> ImperialTriadCard = new()
        {
            "九宫幻卡：雷古拉·范·休著斯",
            "九宫幻卡：魔导先锋",
            "九宫幻卡：魔导炮艇",
            "九宫幻卡：魔导猎手",
            "九宫幻卡：魔导浮空装甲",
            "九宫幻卡：武装重甲",
        };
        /// <summary>
        /// 九宫幻卡梦想包
        /// </summary>
        public static List<string> DreamTriadCard = new()
        {
            "九宫幻卡：斐利亚",
            "九宫幻卡：妖灵王缇坦妮雅",
            "九宫幻卡：艾洛斯",
            "九宫幻卡：斯托尔戈",
            "九宫幻卡：无瑕灵君",
            "九宫幻卡：大哥布林",
            "九宫幻卡：鬣蜥",
            "九宫幻卡：水妖",
            "九宫幻卡：凉南希",
            "九宫幻卡：光之巫女",
            "九宫幻卡：古塔尼亚",
        };
    }
}
